Ran Plan for project: `development` dir: `deployment/dev/terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_storage_bucket.tech-docs will be created
+ resource "google_storage_bucket" "tech-docs" {
+       effective_labels            = (known after apply)
+       force_destroy               = false
+       id                          = (known after apply)
+       location                    = "US"
+       name                        = "bits-backstage-dev-tech-docs"
+       project                     = "bits-backstage-dev"
+       public_access_prevention    = (known after apply)
+       rpo                         = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       terraform_labels            = (known after apply)
+       uniform_bucket_level_access = true
+       url                         = (known after apply)

+       lifecycle_rule {
+           action {
+               type = "Delete"
            }
+           condition {
+               age                   = 365
+               matches_prefix        = []
+               matches_storage_class = []
+               matches_suffix        = []
+               num_newer_versions    = 1
+               with_state            = (known after apply)
            }
        }

+       versioning {
+           enabled = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p development`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fbackstage%252Fdeployment%252Fdev%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p development`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`